# მიიღებს მთელ რიცხვს
# დაბეჭდოს რიცხვის ყველა მარტივი გამყოფი ერთ ხაზზე
# შემოსული რიცხვის მაქსიმალური მნიშვნელობა უნდა იყოს 10
# 2, 3, 5, 7

number = int(input("გთხოვთ შეიყვანოთ 10-ზე ნაკლები რიცხვი: "))

if number == 2 or number == 4 or number == 8:
    print("რიცხვის მარტივი გამყოფი: 2")
elif number == 3 or number == 9:
    print("რიცხვის მარტივი გამყოფი: 3")
elif number == 5:
    print("რიცხვის მარტივი გამყოფი: 5")
elif number == 6:
    print("რიცხვის მარტივი გამყოფი: 2, 3")
elif number == 7:
    print("რიცხვის მარტივი გამყოფი: 7")
elif number == 10:
    print("რიცხვის მარტივი გამყოფი: 2, 5")
else:
    print("რიცხვი 10-ზე მეტია")